## prod plan
```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_role.workato_collector_lambda_role has been changed
  ~ resource "aws_iam_role" "workato_collector_lambda_role" {
        id                    = "workato_metrics_proc_lambda_role"
        name                  = "workato_metrics_proc_lambda_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

+       inline_policy {
+           name   = "policy_workato_collectorTest"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "s3:GetLifecycleConfiguration",
+                               "s3:GetBucketTagging",
+                               "s3:GetInventoryConfiguration",
+                               "s3:GetObjectVersionTagging",
+                               "s3:ListBucketVersions",
+                               "s3:GetBucketLogging",
+                               "s3:ListBucket",
+                               "s3:GetAccelerateConfiguration",
+                               "s3:GetBucketPolicy",
+                               "s3:GetStorageLensConfigurationTagging",
+                               "s3:GetObjectVersionTorrent",
+                               "s3:GetObjectAcl",
+                               "s3:GetEncryptionConfiguration",
+                               "s3:GetBucketObjectLockConfiguration",
+                               "s3:GetIntelligentTieringConfiguration",
+                               "s3:GetBucketRequestPayment",
+                               "s3:GetAccessPointPolicyStatus",
+                               "s3:GetObjectVersionAcl",
+                               "s3:GetObjectTagging",
+                               "s3:GetMetricsConfiguration",
+                               "s3:GetBucketOwnershipControls",
+                               "s3:GetBucketPublicAccessBlock",
+                               "s3:GetBucketPolicyStatus",
+                               "s3:ListBucketMultipartUploads",
+                               "s3:GetObjectRetention",
+                               "s3:GetBucketWebsite",
+                               "s3:GetJobTagging",
+                               "s3:GetBucketVersioning",
+                               "s3:GetBucketAcl",
+                               "s3:GetObjectLegalHold",
+                               "s3:GetBucketNotification",
+                               "s3:GetReplicationConfiguration",
+                               "s3:ListMultipartUploadParts",
+                               "s3:GetObject",
+                               "s3:GetStorageLensConfiguration",
+                               "s3:GetObjectTorrent",
+                               "s3:DescribeJob",
+                               "s3:GetBucketCORS",
+                               "s3:GetAnalyticsConfiguration",
+                               "s3:GetObjectVersionForReplication",
+                               "s3:GetBucketLocation",
+                               "s3:GetAccessPointPolicy",
+                               "s3:GetObjectVersion",
+                               "s3:GetStorageLensDashboard",
                            ]
+                           Effect   = "Allow"
+                           Resource = [
+                               "arn:aws:s3:::tfstateedudev",
+                               "arn:aws:s3:::tfstateedudev/*",
                            ]
+                           Sid      = "VisualEditor0"
                        },
+                       {
+                           Action   = [
+                               "s3:ListStorageLensConfigurations",
+                               "s3:GetAccessPoint",
+                               "s3:GetAccountPublicAccessBlock",
+                               "s3:ListAllMyBuckets",
+                               "s3:ListAccessPoints",
+                               "s3:ListJobs",
+                               "s3:ListObjects",
                            ]
+                           Effect   = "Allow"
+                           Resource = "*"
+                           Sid      = "VisualEditor1"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # aws_iam_role.workato_collector_lambda_role will be destroyed
-   resource "aws_iam_role" "workato_collector_lambda_role" {
-       arn                   = "arn:aws:iam::293804951370:role/workato_metrics_proc_lambda_role" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2022-06-21T12:34:53Z" -> null
-       force_detach_policies = false -> null
-       id                    = "workato_metrics_proc_lambda_role" -> null
-       managed_policy_arns   = [] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "workato_metrics_proc_lambda_role" -> null
-       path                  = "/" -> null
-       tags                  = {} -> null
-       tags_all              = {} -> null
-       unique_id             = "AROAUI2BDY5FKO24F7EB7" -> null

-       inline_policy {
-           name   = "policy_workato_collector" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "logs:GetLogRecord",
-                               "logs:CreateLogStream",
-                               "logs:StartQuery",
-                               "logs:GetQueryResults",
-                               "logs:GetLogEvents",
-                               "logs:DeleteLogDelivery",
-                               "logs:AssociateKmsKey",
-                               "logs:PutDestination",
-                               "logs:DisassociateKmsKey",
-                               "logs:DeleteLogGroup",
-                               "logs:PutDestinationPolicy",
-                               "logs:DeleteDestination",
-                               "logs:PutLogEvents",
-                               "logs:CreateLogGroup",
-                               "logs:PutMetricFilter",
-                               "logs:CreateLogDelivery",
-                               "logs:PutRetentionPolicy",
-                               "logs:CreateExportTask",
                            ]
-                           Effect   = "Allow"
-                           Resource = "*"
-                           Sid      = "CloudwatchPermissions"
                        },
-                       {
-                           Action   = [
-                               "s3:*Object*",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::tfstateedudev/*",
                            ]
-                           Sid      = "VisualEditor1"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "policy_workato_collectorTest" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "s3:GetLifecycleConfiguration",
-                               "s3:GetBucketTagging",
-                               "s3:GetInventoryConfiguration",
-                               "s3:GetObjectVersionTagging",
-                               "s3:ListBucketVersions",
-                               "s3:GetBucketLogging",
-                               "s3:ListBucket",
-                               "s3:GetAccelerateConfiguration",
-                               "s3:GetBucketPolicy",
-                               "s3:GetStorageLensConfigurationTagging",
-                               "s3:GetObjectVersionTorrent",
-                               "s3:GetObjectAcl",
-                               "s3:GetEncryptionConfiguration",
-                               "s3:GetBucketObjectLockConfiguration",
-                               "s3:GetIntelligentTieringConfiguration",
-                               "s3:GetBucketRequestPayment",
-                               "s3:GetAccessPointPolicyStatus",
-                               "s3:GetObjectVersionAcl",
-                               "s3:GetObjectTagging",
-                               "s3:GetMetricsConfiguration",
-                               "s3:GetBucketOwnershipControls",
-                               "s3:GetBucketPublicAccessBlock",
-                               "s3:GetBucketPolicyStatus",
-                               "s3:ListBucketMultipartUploads",
-                               "s3:GetObjectRetention",
-                               "s3:GetBucketWebsite",
-                               "s3:GetJobTagging",
-                               "s3:GetBucketVersioning",
-                               "s3:GetBucketAcl",
-                               "s3:GetObjectLegalHold",
-                               "s3:GetBucketNotification",
-                               "s3:GetReplicationConfiguration",
-                               "s3:ListMultipartUploadParts",
-                               "s3:GetObject",
-                               "s3:GetStorageLensConfiguration",
-                               "s3:GetObjectTorrent",
-                               "s3:DescribeJob",
-                               "s3:GetBucketCORS",
-                               "s3:GetAnalyticsConfiguration",
-                               "s3:GetObjectVersionForReplication",
-                               "s3:GetBucketLocation",
-                               "s3:GetAccessPointPolicy",
-                               "s3:GetObjectVersion",
-                               "s3:GetStorageLensDashboard",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:s3:::tfstateedudev",
-                               "arn:aws:s3:::tfstateedudev/*",
                            ]
-                           Sid      = "VisualEditor0"
                        },
-                       {
-                           Action   = [
-                               "s3:ListStorageLensConfigurations",
-                               "s3:GetAccessPoint",
-                               "s3:GetAccountPublicAccessBlock",
-                               "s3:ListAllMyBuckets",
-                               "s3:ListAccessPoints",
-                               "s3:ListJobs",
-                               "s3:ListObjects",
                            ]
-                           Effect   = "Allow"
-                           Resource = "*"
-                           Sid      = "VisualEditor1"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.s3_policy_workato_collector will be destroyed
-   resource "aws_iam_role_policy" "s3_policy_workato_collector" {
-       id     = "workato_metrics_proc_lambda_role:policy_workato_collector" -> null
-       name   = "policy_workato_collector" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:GetLogRecord",
-                           "logs:CreateLogStream",
-                           "logs:StartQuery",
-                           "logs:GetQueryResults",
-                           "logs:GetLogEvents",
-                           "logs:DeleteLogDelivery",
-                           "logs:AssociateKmsKey",
-                           "logs:PutDestination",
-                           "logs:DisassociateKmsKey",
-                           "logs:DeleteLogGroup",
-                           "logs:PutDestinationPolicy",
-                           "logs:DeleteDestination",
-                           "logs:PutLogEvents",
-                           "logs:CreateLogGroup",
-                           "logs:PutMetricFilter",
-                           "logs:CreateLogDelivery",
-                           "logs:PutRetentionPolicy",
-                           "logs:CreateExportTask",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
-                       Sid      = "CloudwatchPermissions"
                    },
-                   {
-                       Action   = [
-                           "s3:*Object*",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::tfstateedudev/*",
                        ]
-                       Sid      = "VisualEditor1"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "workato_metrics_proc_lambda_role" -> null
    }

  # aws_iam_role_policy.s3_policy_workato_collectorTest will be destroyed
-   resource "aws_iam_role_policy" "s3_policy_workato_collectorTest" {
-       id     = "workato_metrics_proc_lambda_role:policy_workato_collectorTest" -> null
-       name   = "policy_workato_collectorTest" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "s3:GetLifecycleConfiguration",
-                           "s3:GetBucketTagging",
-                           "s3:GetInventoryConfiguration",
-                           "s3:GetObjectVersionTagging",
-                           "s3:ListBucketVersions",
-                           "s3:GetBucketLogging",
-                           "s3:ListBucket",
-                           "s3:GetAccelerateConfiguration",
-                           "s3:GetBucketPolicy",
-                           "s3:GetStorageLensConfigurationTagging",
-                           "s3:GetObjectVersionTorrent",
-                           "s3:GetObjectAcl",
-                           "s3:GetEncryptionConfiguration",
-                           "s3:GetBucketObjectLockConfiguration",
-                           "s3:GetIntelligentTieringConfiguration",
-                           "s3:GetBucketRequestPayment",
-                           "s3:GetAccessPointPolicyStatus",
-                           "s3:GetObjectVersionAcl",
-                           "s3:GetObjectTagging",
-                           "s3:GetMetricsConfiguration",
-                           "s3:GetBucketOwnershipControls",
-                           "s3:GetBucketPublicAccessBlock",
-                           "s3:GetBucketPolicyStatus",
-                           "s3:ListBucketMultipartUploads",
-                           "s3:GetObjectRetention",
-                           "s3:GetBucketWebsite",
-                           "s3:GetJobTagging",
-                           "s3:GetBucketVersioning",
-                           "s3:GetBucketAcl",
-                           "s3:GetObjectLegalHold",
-                           "s3:GetBucketNotification",
-                           "s3:GetReplicationConfiguration",
-                           "s3:ListMultipartUploadParts",
-                           "s3:GetObject",
-                           "s3:GetStorageLensConfiguration",
-                           "s3:GetObjectTorrent",
-                           "s3:DescribeJob",
-                           "s3:GetBucketCORS",
-                           "s3:GetAnalyticsConfiguration",
-                           "s3:GetObjectVersionForReplication",
-                           "s3:GetBucketLocation",
-                           "s3:GetAccessPointPolicy",
-                           "s3:GetObjectVersion",
-                           "s3:GetStorageLensDashboard",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::tfstateedudev",
-                           "arn:aws:s3:::tfstateedudev/*",
                        ]
-                       Sid      = "VisualEditor0"
                    },
-                   {
-                       Action   = [
-                           "s3:ListStorageLensConfigurations",
-                           "s3:GetAccessPoint",
-                           "s3:GetAccountPublicAccessBlock",
-                           "s3:ListAllMyBuckets",
-                           "s3:ListAccessPoints",
-                           "s3:ListJobs",
-                           "s3:ListObjects",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
-                       Sid      = "VisualEditor1"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "workato_metrics_proc_lambda_role" -> null
    }

  # aws_lambda_function.workato_collector will be destroyed
-   resource "aws_lambda_function" "workato_collector" {
-       architectures                  = [
-           "x86_64",
        ] -> null
-       arn                            = "arn:aws:lambda:eu-west-1:293804951370:function:workato_collector" -> null
-       filename                       = "../../../code/src/workato_collector.zip" -> null
-       function_name                  = "workato_collector" -> null
-       handler                        = "main.lambda_handler" -> null
-       id                             = "workato_collector" -> null
-       invoke_arn                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:293804951370:function:workato_collector/invocations" -> null
-       last_modified                  = "2022-06-21T13:24:42.000+0000" -> null
-       layers                         = [] -> null
-       memory_size                    = 128 -> null
-       package_type                   = "Zip" -> null
-       publish                        = false -> null
-       qualified_arn                  = "arn:aws:lambda:eu-west-1:293804951370:function:workato_collector:$LATEST" -> null
-       reserved_concurrent_executions = -1 -> null
-       role                           = "arn:aws:iam::293804951370:role/workato_metrics_proc_lambda_role" -> null
-       runtime                        = "python3.8" -> null
-       source_code_hash               = "c/4YsisbqZOQSHkQRLyhFd12ny/VhE50eVieLKBmVRQ=" -> null
-       source_code_size               = 31653162 -> null
-       tags                           = {} -> null
-       tags_all                       = {} -> null
-       timeout                        = 60 -> null
-       version                        = "$LATEST" -> null

-       ephemeral_storage {
-           size = 512 -> null
        }

-       tracing_config {
-           mode = "PassThrough" -> null
        }
    }

  # aws_s3_bucket.this_bucket will be created
+   resource "aws_s3_bucket" "this_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "gitactionseduadevintaprod1455"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule {
+           allowed_headers = (known after apply)
+           allowed_methods = (known after apply)
+           allowed_origins = (known after apply)
+           expose_headers  = (known after apply)
+           max_age_seconds = (known after apply)
        }

+       grant {
+           id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # aws_s3_object.object will be created
+   resource "aws_s3_object" "object" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "demo/directory/folder1/folder2/FolderC/FolderD/FolderK/"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # null_resource.workato_collector will be destroyed
-   resource "null_resource" "workato_collector" {
-       id       = "3839780419185333318" -> null
-       triggers = {
-           "build"        = "+QLAlFDv21SLJ1ea1rTpzrCCwfAxRqtfFxhOL581/AI="
-           "handler"      = "OF2lH4Z+vKfNLRGkxbmaxbGEMoi+qD9688yckPnGyD8="
-           "requirements" = "8iQgKfCE2dZwA3NS9L+X8lLlRtI9e/irinrG7uFT64E="
        } -> null
    }

Plan: 2 to add, 0 to change, 5 to destroy.
```